Tekla.Structures.Geometry3d.PolyLine
The PolyLine class represents a line that consists of one or more line segments.
To create a polyline, you have to give a list of the points that will form the polyline.
The first point in the list will be connected with the second point in the list,
the second point in the list will be connected with the third point in the list, etc.

Tekla.Structures.Geometry3d.PolyLine.Points
The points the polyline consists of.

Tekla.Structures.Geometry3d.PolyLine.#ctor(System.Collections.IEnumerable)
Instantiates a polyline with the given Points.
Points: A list of the points that will form the polyline.

Tekla.Structures.Geometry3d.PolyLine.Equals(System.Object)
Returns true if the objects are equal.
O: The object that equality is wished to be checked with.
Returns: True if the objects are equal.

Tekla.Structures.Geometry3d.PolyLine.Length
Returns the length of a polyline.
Returns: The length of the polyline.

Tekla.Structures.Geometry3d.PolyLine.GetHashCode
Returns a hash code for a polyline.
Notice, in extremely rare cases, you might not get the same
hash code for two polylines even though they are considered equal! This
should, however, happen only in extremely rare cases!
Returns: The hash code for the polyline.

Tekla.Structures.Geometry3d.PolyLine.op_Equality(Tekla.Structures.Geometry3d.PolyLine,Tekla.Structures.Geometry3d.PolyLine)
Checks the equality of two polylines.
PolyLine1: The first polyline to be used.
PolyLine2: The second polyline to be used.
Returns: True if the two polylines are equal.
False otherwise.

Tekla.Structures.Geometry3d.PolyLine.op_Inequality(Tekla.Structures.Geometry3d.PolyLine,Tekla.Structures.Geometry3d.PolyLine)
Checks the inequality of two polylines.
PolyLine1: The first polyline to be used.
PolyLine2: The second polyline to be used.
Returns: True if the two polylines are not equal.
False otherwise.